var	api=[];
api["测试1"]=
	{
		"接口地址":"",
		"支持格式":"json",
		"请求方式":"get/post",
		"接口介绍":"没什么用..",
		"请求示例":"1:xxxxxxxxxxxxx<br>2:xxxxxxxxxxx<br>3:xxxxxxxx<br>4:xxxxxx",		
		"请求参数":
			[
			 	{"名称":"name","类型":"string","必填":"是","说明":"需要查询的菜谱dd名....需要查询的菜谱dd名...."},
			 	{"名称":"name","类型":"string","必填":"是","说明":"需要查询的dd菜谱名...."}
			 ],
		"返回参数":
			[
			 	{"名称":"name","类型":"string","说明":"需要查询的eee菜谱名...."}			
			]
	}


api["测试2"]=
	{
		"接口地址":"",
		"支持格式":"json",
		"请求方式":"get/post",
		"接口介绍":"没什么用..",
		"请求示例":"xxxxxxxxxxxxx",		
		"请求参数":
			[
			 	{"名称":"name","类型":"string","必填":"是","说明":"需asdfs要查询的菜谱名...."},
			 	{"名称":"name","类型":"string","必填":"是","说明":"需要查sdfsd询的菜谱名...."}
			 ],
		"返回参数":
			[
			 	{"名称":"name","类型":"string","说明":"需要查询的菜谱名...."}			
			]
	} 


for(var i=3;i<13;i++){

api["测试" + i]=
	{
		"接口地址":"",
		"支持格式":"json",
		"请求方式":"get/post",
		"接口介绍":"没什么用..",
		"请求示例":"xxxxxxxxxxxxx",		
		"请求参数":
			[
			 	{"名称":"name","类型":"string","必填":"是","说明":"需asdfs要查询的菜谱名...."},
			 	{"名称":"name","类型":"string","必填":"是","说明":"需要查sdfsd询的菜谱名...."}
			 ],
		"返回参数":
			[
			 	{"名称":"name","类型":"string","说明":"需要查询的菜谱名...."}			
			]
	}
}
